Public Attributes | List of all members
API_CalcAngleFormat Struct Reference
Project Settings
The API_CalcUnitPrefs structure contains this structure. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_AngleTypeID  | unit
The type of the angle measurement unit.
short  | decimals
Number of decimals for angle measurement unit [0..4].
short  | accuracy
European methods for rounding decimal values.
Detailed Description
The API_CalcUnitPrefs structure contains this structure.
Member Data Documentation
◆ accuracy
 API_CalcAngleFormat::accuracy
European methods for rounding decimal values.
◆ decimals
 API_CalcAngleFormat::decimals
Number of decimals for angle measurement unit [0..4].
◆ unit
 API_CalcAngleFormat::unit
The type of the angle measurement unit.